public class Maze {
    // Константа для стен
    public static final char WALL = char(9873);

    // Генерация первого уровня

    public static char[][] generateLevel1() {
        return new char[][] {

            {WALL, '#', '#', '#', '#'},
            {'#', 'P', '#', 'E', '#'},
            {'#', ' ', '#', ' ', '#'},
            {'#', ' ', ' ', ' ', '#'},
            {'#', '#', '#', '#', '#'}
        };
    }

    // Генерация второго уровня
    public static char[][] generateLevel2() {
        return new char[][] {
            {'#', '#', '#', '#', '#', '#'},
            {'#', 'P', ' ', ' ', ' ', '#'},
            {'#', '#', '#', ' ', '#', '#'},
            {'#', ' ', '#', ' ', ' ', '#'},
            {'#', ' ', ' ', ' ', 'E', '#'},
            {'#', '#', '#', '#', '#', '#'}
        };
    }

    // Генерация третьего уровня
    public static char[][] generateLevel3() {
        return new char[][] {
            {'#', '#', '#', '#', '#', '#', '#'},
            {'#', 'P', ' ', ' ', ' ', ' ', '#'},
            {'#', '#', '#', '#', '#', ' ', '#'},
            {'#', 'E', ' ', ' ', '#', ' ', '#'},
            {'#', ' ', '#', ' ', ' ', ' ', '#'},
            {'#', ' ', ' ', ' ', '#', ' ', '#'},
            {'#', '#', '#', '#', '#', '#', '#'}
        };
    }

    // Метод для отображения лабиринта
    public static void printMaze(char[][] maze) {
        for (char[] row : maze) {
            for (char cell : row) {
                System.out.print(cell);
            }
            System.out.println();
        }
    }
}
